lkolbly/cmsis-svd/data/TexasInstruments/LM3S5747.svd
        <register>
          <name>DIS1</name>
          <description>Interrupt 32-54 Clear Enable</description>
          <addressOffset>0x00000184</addressOffset>
          <fields>
            <field>
              <name>NVIC_DIS1_INT</name>
              <description>Interrupt Disable</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT32</name>
                  <description>Interrupt 32 disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT33</name>
                  <description>Interrupt 33 disable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT34</name>
                  <description>Interrupt 34 disable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT35</name>
                  <description>Interrupt 35 disable</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT36</name>
                  <description>Interrupt 36 disable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT37</name>
                  <description>Interrupt 37 disable</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT38</name>
                  <description>Interrupt 38 disable</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT39</name>
                  <description>Interrupt 39 disable</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT40</name>
                  <description>Interrupt 40 disable</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT41</name>
                  <description>Interrupt 41 disable</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT42</name>
                  <description>Interrupt 42 disable</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT43</name>
                  <description>Interrupt 43 disable</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT44</name>
                  <description>Interrupt 44 disable</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT45</name>
                  <description>Interrupt 45 disable</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT46</name>
                  <description>Interrupt 46 disable</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT47</name>
                  <description>Interrupt 47 disable</description>
                  <value>0x8000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND0</name>
          <description>Interrupt 0-31 Set Pending</description>
          <addressOffset>0x00000200</addressOffset>
          <fields>
            <field>
              <name>NVIC_PEND0_INT</name>
              <description>Interrupt Set Pending</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT0</name>
                  <description>Interrupt 0 pend</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT1</name>
                  <description>Interrupt 1 pend</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT2</name>
                  <description>Interrupt 2 pend</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT3</name>
                  <description>Interrupt 3 pend</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT4</name>
                  <description>Interrupt 4 pend</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT5</name>
                  <description>Interrupt 5 pend</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT6</name>
                  <description>Interrupt 6 pend</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT7</name>
                  <description>Interrupt 7 pend</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT8</name>
                  <description>Interrupt 8 pend</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT9</name>
                  <description>Interrupt 9 pend</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT10</name>
                  <description>Interrupt 10 pend</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT11</name>
                  <description>Interrupt 11 pend</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT12</name>
                  <description>Interrupt 12 pend</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT13</name>
                  <description>Interrupt 13 pend</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT14</name>
                  <description>Interrupt 14 pend</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT15</name>
                  <description>Interrupt 15 pend</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT16</name>
                  <description>Interrupt 16 pend</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT17</name>
                  <description>Interrupt 17 pend</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT18</name>
                  <description>Interrupt 18 pend</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT19</name>
                  <description>Interrupt 19 pend</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT20</name>
                  <description>Interrupt 20 pend</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT21</name>
                  <description>Interrupt 21 pend</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT22</name>
                  <description>Interrupt 22 pend</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT23</name>
                  <description>Interrupt 23 pend</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT24</name>
                  <description>Interrupt 24 pend</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT25</name>
                  <description>Interrupt 25 pend</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT26</name>
                  <description>Interrupt 26 pend</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT27</name>
                  <description>Interrupt 27 pend</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT28</name>
                  <description>Interrupt 28 pend</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT29</name>
                  <description>Interrupt 29 pend</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT30</name>
                  <description>Interrupt 30 pend</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT31</name>
                  <description>Interrupt 31 pend</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND1</name>
          <description>Interrupt 32-54 Set Pending</description>
          <addressOffset>0x00000204</addressOffset>
          <fields>
            <field>
              <name>NVIC_PEND1_INT</name>
              <description>Interrupt Set Pending</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT32</name>
                  <description>Interrupt 32 pend</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT33</name>
                  <description>Interrupt 33 pend</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT34</name>
                  <description>Interrupt 34 pend</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT35</name>
                  <description>Interrupt 35 pend</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT36</name>
                  <description>Interrupt 36 pend</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT37</name>
                  <description>Interrupt 37 pend</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT38</name>
                  <description>Interrupt 38 pend</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT39</name>
                  <description>Interrupt 39 pend</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT40</name>
                  <description>Interrupt 40 pend</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT41</name>
                  <description>Interrupt 41 pend</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT42</name>
                  <description>Interrupt 42 pend</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT43</name>
                  <description>Interrupt 43 pend</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT44</name>
                  <description>Interrupt 44 pend</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT45</name>
                  <description>Interrupt 45 pend</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT46</name>
                  <description>Interrupt 46 pend</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND1_INT47</name>
                  <description>Interrupt 47 pend</description>
                  <value>0x8000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND0</name>
          <description>Interrupt 0-31 Clear Pending</description>
          <addressOffset>0x00000280</addressOffset>
          <fields>
            <field>
              <name>NVIC_UNPEND0_INT</name>
              <description>Interrupt Clear Pending</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT0</name>
                  <description>Interrupt 0 unpend</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT1</name>
                  <description>Interrupt 1 unpend</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT2</name>
                  <description>Interrupt 2 unpend</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT3</name>
                  <description>Interrupt 3 unpend</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT4</name>
                  <description>Interrupt 4 unpend</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT5</name>
                  <description>Interrupt 5 unpend</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT6</name>
                  <description>Interrupt 6 unpend</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT7</name>
                  <description>Interrupt 7 unpend</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT8</name>
                  <description>Interrupt 8 unpend</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT9</name>
                  <description>Interrupt 9 unpend</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT10</name>
                  <description>Interrupt 10 unpend</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT11</name>
                  <description>Interrupt 11 unpend</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT12</name>
                  <description>Interrupt 12 unpend</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT13</name>
                  <description>Interrupt 13 unpend</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT14</name>
                  <description>Interrupt 14 unpend</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT15</name>
                  <description>Interrupt 15 unpend</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT16</name>
                  <description>Interrupt 16 unpend</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT17</name>
                  <description>Interrupt 17 unpend</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT18</name>
                  <description>Interrupt 18 unpend</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT19</name>
                  <description>Interrupt 19 unpend</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT20</name>
                  <description>Interrupt 20 unpend</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT21</name>
                  <description>Interrupt 21 unpend</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT22</name>
                  <description>Interrupt 22 unpend</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT23</name>
                  <description>Interrupt 23 unpend</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT24</name>
                  <description>Interrupt 24 unpend</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT25</name>
                  <description>Interrupt 25 unpend</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT26</name>
                  <description>Interrupt 26 unpend</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT27</name>
                  <description>Interrupt 27 unpend</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT28</name>
                  <description>Interrupt 28 unpend</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT29</name>
                  <description>Interrupt 29 unpend</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT30</name>
                  <description>Interrupt 30 unpend</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT31</name>
                  <description>Interrupt 31 unpend</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
